performance/reports/archive/runs/normal-day-2026-08-20T01-58-05/summary.txt
     ✓ login 200
     ✓ post detail 200
     ✓ meal today 200
     ✓ chat rooms 200
     ✓ board list 200
     ✓ post reaction 2xx
     ✓ timetable today 200
     ✓ hot daily 200
     ✓ post search 200
     ✓ post list 200
     ✓ scrap 2xx
     ✓ comment list 200
     ✓ unread count 200
     ✓ chat messages 200
     ✓ notif list 200
     ✓ read one 200
     ✓ chat read 200
     ✓ user info 200
     ✓ my posts 200
     ✓ friend list 200
     ✓ ws handshake 101
     ✓ post create 2xx
     ✓ comment create 2xx
     ✓ post update 200
     ✓ post delete 200
     ✓ comment reaction 200
     ✓ received reqs 200
     ✓ logout 200
     ✓ meal month 200
     ✓ read all 200
     ✓ refresh 200

     auth_token_refreshes...........: 26      0.042162/s
     chat_ws_messages_sent..........: 723     1.172438/s
     chat_ws_rtt....................: avg=3.42s   min=15ms     med=2.86s    max=13.94s  p(90)=7.31s   p(95)=9.03s    p(99)=12.42s  
     checks.........................: 100.00% ✓ 11272     ✗ 0    
     ✓ { phase:measure }............: 100.00% ✓ 6026      ✗ 0    
     ✓ { phase:rampdown }...........: 100.00% ✓ 1943      ✗ 0    
     ✓ { phase:warmup }.............: 100.00% ✓ 3303      ✗ 0    
     data_received..................: 514 MB  834 kB/s
     data_sent......................: 4.6 MB  7.4 kB/s
     http_req_blocked...............: avg=19.73µs min=1.67µs   med=7.12µs   max=24.06ms p(90)=13.67µs p(95)=16.99µs  p(99)=303.66µs
     http_req_connecting............: avg=8.44µs  min=0s       med=0s       max=23.75ms p(90)=0s      p(95)=0s       p(99)=205.28µs
     http_req_duration..............: avg=6.07s   min=2.08ms   med=5.5s     max=35.7s   p(90)=11.68s  p(95)=13.68s   p(99)=19.02s  
       { expected_response:true }...: avg=6.07s   min=2.08ms   med=5.5s     max=35.7s   p(90)=11.68s  p(95)=13.68s   p(99)=19.02s  
     ✓ { feature:auth }.............: avg=3.19s   min=81.42ms  med=2.18s    max=15.6s   p(90)=7.33s   p(95)=9.51s    p(99)=12.82s  
     ✓ { feature:board }............: avg=5.9s    min=2.21ms   med=5.7s     max=23.23s  p(90)=11.05s  p(95)=12.82s   p(99)=15.56s  
     ✓ { feature:chat }.............: avg=6.25s   min=5.33ms   med=5.91s    max=21.48s  p(90)=11.4s   p(95)=13.41s   p(99)=15.7s   
     ✓ { feature:comment }..........: avg=7.78s   min=2.08ms   med=6.86s    max=35.7s   p(90)=15.75s  p(95)=19s      p(99)=24.01s  
     ✓ { feature:friend }...........: avg=6.12s   min=5.78ms   med=5.43s    max=16.32s  p(90)=12.05s  p(95)=13.7s    p(99)=14.72s  
     ✓ { feature:hot }..............: avg=5.85s   min=9.62ms   med=5.53s    max=20.25s  p(90)=10.88s  p(95)=12.57s   p(99)=15.38s  
     ✓ { feature:mypage }...........: avg=5.92s   min=2.48ms   med=5.81s    max=21.33s  p(90)=11.91s  p(95)=13.44s   p(99)=15.43s  
     ✓ { feature:notification }.....: avg=6.58s   min=6.53ms   med=6.52s    max=28.32s  p(90)=11.3s   p(95)=12.88s   p(99)=15.55s  
     ✓ { feature:post }.............: avg=5.58s   min=2.24ms   med=5.17s    max=24s     p(90)=10.72s  p(95)=12.37s   p(99)=15.07s  
     ✓ { feature:reaction }.........: avg=5.67s   min=17.54ms  med=5.29s    max=17.17s  p(90)=10.68s  p(95)=13.01s   p(99)=15.57s  
     ✓ { feature:school }...........: avg=5.55s   min=21.05ms  med=5.17s    max=13.94s  p(90)=10.65s  p(95)=11.61s   p(99)=13.23s  
     ✓ { feature:scrap }............: avg=5.93s   min=21.02ms  med=5.68s    max=14.93s  p(90)=10.65s  p(95)=11.79s   p(99)=14.63s  
     ✓ { feature:timetable }........: avg=6.06s   min=10.49ms  med=6.02s    max=15.47s  p(90)=10.95s  p(95)=12.42s   p(99)=15.07s  
     ✓ { op:auth }..................: avg=3.19s   min=81.42ms  med=2.18s    max=15.6s   p(90)=7.33s   p(95)=9.51s    p(99)=12.82s  
     ✗ { op:read,phase:measure }....: avg=7.63s   min=2.81ms   med=7.06s    max=35.7s   p(90)=12.81s  p(95)=14.59s   p(99)=19.65s  
     ✗ { op:write,phase:measure }...: avg=8.11s   min=391.82ms med=7.69s    max=19.51s  p(90)=13.66s  p(95)=14.46s   p(99)=16.95s  
     ✓ { page:0 }...................: avg=4s      min=2.28ms   med=3.53s    max=16.36s  p(90)=8.5s    p(95)=10.03s   p(99)=13.47s  
     ✓ { page:1 }...................: avg=4.29s   min=2.47ms   med=3.95s    max=15.2s   p(90)=8.99s   p(95)=10.42s   p(99)=11.9s   
     ✓ { page:2 }...................: avg=4.42s   min=2.4ms    med=3.95s    max=15.55s  p(90)=9.5s    p(95)=10.61s   p(99)=12.75s  
     ✓ { page:3 }...................: avg=4.39s   min=4.6ms    med=4.05s    max=12.69s  p(90)=9.43s   p(95)=9.95s    p(99)=11.47s  
     ✓ { page:4 }...................: avg=4.36s   min=2.24ms   med=4.15s    max=12.5s   p(90)=8.45s   p(95)=9.79s    p(99)=11s     
     ✓ { phase:measure }............: avg=7.67s   min=2.81ms   med=7.11s    max=35.7s   p(90)=12.84s  p(95)=14.56s   p(99)=19.5s   
     ✓ { phase:rampdown }...........: avg=6.01s   min=2.08ms   med=5.48s    max=29.03s  p(90)=10.83s  p(95)=13.01s   p(99)=19.92s  
     ✓ { phase:warmup }.............: avg=3.32s   min=3.45ms   med=2.01s    max=35.7s   p(90)=7.87s   p(95)=9.96s    p(99)=16.23s  
     http_req_failed................: 0.00%   ✓ 0         ✗ 11149
     ✓ { phase:measure }............: 0.00%   ✓ 0         ✗ 5960 
     ✓ { phase:rampdown }...........: 0.00%   ✓ 0         ✗ 1780 
     ✓ { phase:warmup }.............: 0.00%   ✓ 0         ✗ 3409 
     http_req_receiving.............: avg=2.15ms  min=14.32µs  med=324.12µs max=292.1ms p(90)=1.01ms  p(95)=3.66ms   p(99)=72.77ms 
     http_req_sending...............: avg=52.81µs min=5.73µs   med=40µs     max=2.29ms  p(90)=97.24µs p(95)=111.45µs p(99)=191.13µs
     http_req_tls_handshaking.......: avg=0s      min=0s       med=0s       max=0s      p(90)=0s      p(95)=0s       p(99)=0s      
     http_req_waiting...............: avg=6.07s   min=1.94ms   med=5.5s     max=35.69s  p(90)=11.68s  p(95)=13.68s   p(99)=18.95s  
     http_reqs......................: 11149   18.079545/s
     ✓ { feature:auth }.............: 280     0.454056/s
     ✓ { feature:board }............: 1034    1.676765/s
     ✓ { feature:chat }.............: 808     1.310276/s
     ✓ { feature:comment }..........: 1969    3.192988/s
     ✓ { feature:friend }...........: 153     0.248109/s
     ✓ { feature:hot }..............: 1034    1.676765/s
     ✓ { feature:mypage }...........: 170     0.275677/s
     ✓ { feature:notification }.....: 483     0.783247/s
     ✓ { feature:post }.............: 4752    7.705982/s
     ✓ { feature:reaction }.........: 224     0.363245/s
     ✓ { feature:school }...........: 101     0.163785/s
     ✓ { feature:scrap }............: 61      0.098919/s
     ✓ { feature:timetable }........: 80      0.12973/s
     ✓ { op:auth }..................: 280     0.454056/s
     ✓ { op:read }..................: 10035   16.27305/s
     ✓ { op:write }.................: 834     1.352439/s
     ✓ { page:0 }...................: 569     0.922707/s
     ✓ { page:1 }...................: 190     0.30811/s
     ✓ { page:2 }...................: 129     0.20919/s
     ✓ { page:3 }...................: 80      0.12973/s
     ✓ { page:4 }...................: 66      0.107028/s
     ✓ { phase:measure }............: 5960    9.664911/s
     ✓ { phase:rampdown }...........: 1780    2.8865/s
     ✓ { phase:warmup }.............: 3409    5.528134/s
     iteration_duration.............: avg=35.62s  min=1.12s    med=25.73s   max=2m14s   p(90)=1m19s   p(95)=1m30s    p(99)=1m49s   
     iterations.....................: 2548    4.131911/s
     ✓ { phase:measure }............: 0       0/s
     ✓ { phase:rampdown }...........: 0       0/s
     ✓ { phase:warmup }.............: 0       0/s
     phase_iterations...............: 2548    4.131911/s
     ✓ { phase:measure }............: 1400    2.270281/s
     ✓ { phase:rampdown }...........: 471     0.763787/s
     ✓ { phase:warmup }.............: 677     1.097843/s
     vus............................: 2       min=0       max=200
     vus_max........................: 200     min=200     max=200
     ws_connecting..................: avg=4.98s   min=3.97ms   med=4.44s    max=14.92s  p(90)=10.37s  p(95)=11.51s   p(99)=13.03s  
     ws_msgs_received...............: 720     1.167573/s
     ws_msgs_sent...................: 971     1.574602/s
     ws_session_duration............: avg=27.45s  min=15.48s   med=27.42s   max=42.15s  p(90)=36.31s  p(95)=38.02s   p(99)=41.53s  
     ws_sessions....................: 124     0.201082/s